tutorialsOld/surfaceTracking/interTrackMHDmagFoam/slanting2D/system/region_dynamic/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains    2;

method               simple;

simpleCoeffs
{
    n                (2 1 1);
    delta            0.001;
}

hierarchicalCoeffs
{
}

metisCoeffs
{
}

scotchCoeffs
{
}

manualCoeffs
{
}

distributed     no;

roots
(
);

// ************************************************************************* //
